
#include "cl_document.h"
cl_document::cl_document(cl_base* p_head_object, string s_object_name)
	:cl_base(p_head_object, s_object_name)
{

}
void cl_document::init(int pc, const string& t, int pages, int tact)
{
	//--------------------------------------------------
	// Инициализация документа
	// Параметры:
	//     int pc, string &t, int pages, int tact, номер компьтера, название документа, количество страниц, номер такта
	// Возвращаемое значение:
	//     public
	//--------------------------------------------------

	// 1.1 Присвоение полю pc_number значения параметра pc
	pc_number = pc;
	// 2.1 Присвоение полю title значения параметра t
	title = t;
	// 3.1 Присвоение полю pages_left значения параметра pages
	pages_left = pages;
	// 4.1 Присвоение полю tact_added значения параметра tact
	tact_added = tact;
}
int cl_document::get_pc_number()
{
	//--------------------------------------------------
	// Получение номера компьютера
	// Параметры:
	//     
	// Возвращаемое значение:
	//     int, номер ПК
	//--------------------------------------------------

	// 1.1 Возвращение значения поля pc_number
	return pc_number;
}
int cl_document::get_pages_left()
{
	//--------------------------------------------------
	// Получение количества страниц документа
	// Параметры:
	//     
	// Возвращаемое значение:
	//     int, количество страниц
	//--------------------------------------------------

	// 1.1 Возвращение значения поля pages_left
	return pages_left;
}
int cl_document::get_tact_added()
{
	//--------------------------------------------------
	// Получение количества прошедших тактов
	// Параметры:
	//     
	// Возвращаемое значение:
	//     int, номер такта
	//--------------------------------------------------

	// 1.1 Возвращение значения поля tact_added

	return tact_added;
}
void cl_document::set_pages_left(int v)
{
	//--------------------------------------------------
	// Установка количества страниц документа
	// Параметры:
	//     int v, количество страниц
	// Возвращаемое значение:
	//     Не возвращает
	//--------------------------------------------------

	// 1.1 Присвоение полю pages left значения параметра v
	pages_left = v;
}
void cl_document::clear()
{
	//--------------------------------------------------
	// Удаление установленных значений полей для документа
	// Параметры:
	//     
	// Возвращаемое значение:
	//     Не возвращает
	//--------------------------------------------------

	// 1.1 Присвоение полю pc_number значения 0
	pc_number = 0;
	// 2.1 Присвоение полю title значения " "
	title = " ";
	// 3.1 Присвоение полю pages_left значения 0
	pages_left = 0;
	// 4.1 Присвоение полю tact_added значения 0
	tact_added = 0;

}
string cl_document::get_title()
{
	//--------------------------------------------------
	// Получение названия документа
	// Параметры:
	//     
	// Возвращаемое значение:
	//     string, название документа
	//--------------------------------------------------

	// 1.1 Возвращение значения закрытого поля title
	return title;
}
