
#include "cl_tray.h"

cl_tray::cl_tray(cl_base* p_head_object, string s_object_name)
	:cl_base(p_head_object, s_object_name)
{

}
void cl_tray::init(int m)
{
	//--------------------------------------------------
	// Инициализация лотка
	// Параметры:
	//     int m, количество листов
	// Возвращаемое значение:
	//     Не возвращает
	//--------------------------------------------------

	// 1.1 Присвоение полю capacity значения параметра m
	capacity = m;
	// 2.1 Присвоение полю sheets значения параметра m
	sheets = m;
	return;
}
void cl_tray::start_loading()
{
	//--------------------------------------------------
	// Начало загрузки бумаги в лоток
	// Параметры:
	//     
	// Возвращаемое значение:
	//     Не возвращает
	//--------------------------------------------------

	// 1.1 Значение поля load_ticks_left > 0
	if (load_ticks_left > 0)
	{
		return;
	}

	// 1.2 load_ticks_left = 3
	load_ticks_left = 3;
}
void cl_tray::do_tact_loading()
{
	//--------------------------------------------------
	// Выполнение одного такта загрузки
	// Параметры:
	//     
	// Возвращаемое значение:
	//     Не возвращает
	//--------------------------------------------------
	// 1.1 Значение поля load_ticks_left < 0
	if (load_ticks_left <= 0)
	{
		return;
	}

	// 1.2 load_ticks_left --
	load_ticks_left--;;
	//2.1 Значение поля load_ticks_ledt == 0
	if (load_ticks_left == 0)
	{
		// 2.1 Присвоение полю sheets значения поля capacity
		sheets = capacity;
	}
}
bool cl_tray::is_loading()
{
	//--------------------------------------------------
	// Провека загрузки бумаги в лоток
	// Параметры:
	//     
	// Возвращаемое значение:
	//     bool, проверка завершения загрузки
	//--------------------------------------------------

	// 1.1 Возвращение значение поля load_ticks_left > 0
	return load_ticks_left > 0;
}
void cl_tray::consume(int x)
{
	//--------------------------------------------------
	// Уменьшение количества листов в лотке
	// Параметры:
	//     int x, количество листов
	// Возвращаемое значение:
	//     Не возвращает
	//--------------------------------------------------

	// 1.1 Уменьшение поля sheets на значение x
	sheets -= x;
	// 2.1 Значение поля sheets < 0
	if (sheets < 0)
	{
		// 2.1 sheets = 0
		sheets = 0;
	}
}
int cl_tray::get_sheets()
{
	//--------------------------------------------------
	// Получение текущего количества листов в лотке
	// Параметры:
	//     
	// Возвращаемое значение:
	//     int, количество листов
	//--------------------------------------------------

	// 1.1 Возвращение поля sheets
	return sheets;
}
